Revit 2024 API
PreDocEventArgs.Document Property
 The document associated with the event.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public Document Document { get; }
Visual Basic
Public ReadOnly Property Document As Document
	Get
Visual C++
public:
property Document^ Document {
	Document^ get ();
}
See Also
PreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace